{
  "backend/main.mo": "Minimal Motoko canister actor with no methods.",
  "feature_evidence.json": "Feature-evidence report mapping features to affected frontend files, components, and requirement IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files for reference in build planning.",
  "frontend/index.css": "Tailwind base layers and OKLCH variable definitions for light/dark themes, plus global background/foreground styling.",
  "frontend/index.html": "Base HTML shell loading fonts and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Defines TanStack Router routes and global layout with header, footer, transitions, and theme provider.",
  "frontend/src/components/AffiliateCtaPlaceholder.tsx": "Card-based placeholder CTA component with title, description, and disabled external link button.",
  "frontend/src/components/CinematicHero.tsx": "Cinematic hero section with parallax layers, autoplaying background video, overlays, and scroll navigation.",
  "frontend/src/components/DestinationCard.tsx": "Interactive destination card with image hover effects, region/budget badges, tags, and navigation to detail pages.",
  "frontend/src/components/HeroLineSketchOverlay.tsx": "Renders an SVG overlay with gradient topographic lines and adjusts detail level based on screen size.",
  "frontend/src/components/InteractiveIndiaMap.tsx": "Displays an India map with interactive region markers that show tooltips and navigate to filtered destinations.",
  "frontend/src/components/MasonryGrid.tsx": "A simple wrapper component applying a masonry layout class to its children.",
  "frontend/src/components/MobileBottomNav.tsx": "Provides a fixed mobile bottom navigation bar with icons and active-route highlighting.",
  "frontend/src/components/MotionReveal.tsx": "Animates children into view using intersection observer–based fade and slide effects.",
  "frontend/src/components/RippleButton.tsx": "Enhances a button with a click ripple animation while preserving normal button behavior.",
  "frontend/src/components/RouteTransition.tsx": "Fades content during route changes by listening to router load events.",
  "frontend/src/components/SiteFooter.tsx": "Displays the site footer with brand info, navigation links, and a copyright note.",
  "frontend/src/components/SiteHeader.tsx": "Implements a responsive site header with scroll-based styling, desktop nav, mobile drawer, and theme toggle.",
  "frontend/src/components/SocialProofGallery.tsx": "Shows a horizontally scrollable gallery of social-style photo cards with usernames and captions.",
  "frontend/src/components/TagChip.tsx": "Renders a styled tag label with an icon based on the tag type.",
  "frontend/src/components/ThemeToggle.tsx": "Offers a dropdown menu to switch between light, dark, and system themes.",
  "frontend/src/components/TrustBadges.tsx": "Renders a set of trust badges with icons and labels using a styled flex layout.",
  "frontend/src/data/destinations.ts": "Defines TypeScript interfaces and sample data for travel destinations, including metadata, transport, accommodation, and FAQs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for managing Internet Identity authentication, including login, logout, and persisted identity loading.",
  "frontend/src/hooks/useIntersectionReveal.ts": "Exposes a hook that reveals an element when it enters the viewport using IntersectionObserver with reduced‑motion support.",
  "frontend/src/hooks/useParallax.ts": "Implements a parallax scroll effect hook with performance safeguards, reduced‑motion handling, and mobile adjustments.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook exposing backend actor and fetch status for future backend queries.",
  "frontend/src/index.css": "Tailwind CSS setup defining color tokens, dark mode styles, typography, and custom utilities for hero effects.",
  "frontend/src/main.tsx": "Initializes React app with QueryClientProvider and InternetIdentityProvider and mounts it to the DOM.",
  "frontend/src/pages/BlogPage.tsx": "Renders a blog listing page with a featured post, multiple post cards, and animated reveal sections.",
  "frontend/src/pages/BlogPostPage.tsx": "Renders a single blog post page using a mock post object based on the slug, displaying metadata, content, and navigation back to the blog list.",
  "frontend/src/pages/BudgetPage.tsx": "Shows budget-based destination categories with icons, descriptions, and tips, using animated cards and a structured grid layout.",
  "frontend/src/pages/BudgetPlanningPage.tsx": "Provides a detailed budget planning overview with categorized travel budgets, descriptions, and example cost considerations using cards and tables.",
  "frontend/src/pages/CommunityPage.tsx": "Displays community feature previews such as sharing stories, advice, and travel buddies, along with a notice about upcoming community features.",
  "frontend/src/pages/DestinationDetailPage.tsx": "Loads a destination by slug and presents its detailed info including hero image, snapshot, travel details, and fallback UI if not found.",
  "frontend/src/pages/DestinationsPage.tsx": "Lists destinations with search, tab filters, optional region filters, and dynamically filtered results rendered in a masonry grid.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section, featured destinations, budget categories, and resource links using parallax and animated components.",
  "frontend/src/pages/ResourcesPage.tsx": "Displays a resources hub featuring cards for destination guides, travel tips, budgeting, and planning tools.",
  "frontend/src/pages/SafetyGuidePage.tsx": "Provides safety information including emergency numbers and detailed health, location, and preparedness guidance in card format.",
  "frontend/src/pages/TravelTipsPage.tsx": "Shows travel tips through cards and an accordion with detailed advice on planning, packing, and staying connected.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, fonts, animations, shadows, and container settings with custom theme variables.",
  "project_state.json": "Defines project state, known issues, and feature requests focused on fixing region-based destination filtering and adding detailed destinations per region."
}