{
  "backend/main.mo": "Empty Motoko actor with no methods defined.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries for many frontend files describing their roles and functionality.",
  "frontend/index.css": "Tailwind base layer defining OKLCH theme variables, dark mode overrides, and global element styles.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and root layout with header, footer, themes, and page components.",
  "frontend/src/components/AffiliateCtaPlaceholder.tsx": "Reusable CTA card component with title, description, and disabled external link button.",
  "frontend/src/components/CinematicHero.tsx": "Cinematic hero section featuring parallax video, overlays, animations, and scroll navigation.",
  "frontend/src/components/DestinationCard.tsx": "Card component rendering destination preview with image, budget badge, tags, and link to details.",
  "frontend/src/components/HeroLineSketchOverlay.tsx": "Renders an SVG overlay with gradient contour lines that adapt to mobile vs desktop using a resize listener.",
  "frontend/src/components/InteractiveIndiaMap.tsx": "Displays an India map with clickable region markers that show tooltips and scroll to corresponding sections.",
  "frontend/src/components/MasonryGrid.tsx": "Wraps children in a simple masonry-layout container.",
  "frontend/src/components/MobileBottomNav.tsx": "Shows a fixed mobile bottom navigation bar with route-aware highlighting.",
  "frontend/src/components/MotionReveal.tsx": "Applies intersection‑based fade and slide‑in animations to wrapped content.",
  "frontend/src/components/RippleButton.tsx": "Extends a Button with a click ripple animation rendered via positioned spans.",
  "frontend/src/components/RouteTransition.tsx": "Fades content during router navigation events and resets scroll on load.",
  "frontend/src/components/SafeImage.tsx": "Renders an image that swaps to a fallback asset on load error based on aspect ratio.",
  "frontend/src/components/SiteFooter.tsx": "Provides a multi-column footer with branding, navigation links, and copyright.",
  "frontend/src/components/SiteHeader.tsx": "Implements a sticky header with scroll-aware styling, desktop and mobile navigation, and theme toggling.",
  "frontend/src/components/SocialProofGallery.tsx": "Creates a horizontally scrolling gallery of user images styled as polaroids.",
  "frontend/src/components/TagChip.tsx": "Displays a tag label with an associated icon and themed styling.",
  "frontend/src/components/ThemeToggle.tsx": "Provides a dropdown button to switch between light, dark, and system themes using next-themes.",
  "frontend/src/components/TrustBadges.tsx": "Renders a list of trust badges with icons and labels for verified stays, budget, and local insight.",
  "frontend/src/data/destinations.ts": "Exports an array of Destination objects containing detailed data for multiple North India travel spots.",
  "frontend/src/data/destinationTypes.ts": "Defines the Destination TypeScript interface describing travel destination attributes and metadata.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context with login, logout, and stored identity handling using Dfinity AuthClient.",
  "frontend/src/hooks/useIntersectionReveal.ts": "Provides a hook that reveals elements when they enter the viewport using IntersectionObserver.",
  "frontend/src/hooks/useParallax.ts": "Implements a parallax scrolling hook with motion reduction, performance checks, and transform updates.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook exposing the backend actor and fetch state for future backend queries.",
  "frontend/src/index.css": "Defines global styles, Tailwind layers, color variables, utility classes, and visual effects for the app.",
  "frontend/src/main.tsx": "Bootstraps the app by mounting React, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BlogPage.tsx": "Renders the blog listing page with a featured post and a grid of additional posts using cards, images, and motion effects.",
  "frontend/src/pages/BlogPostPage.tsx": "Displays a single blog post based on the route slug, using mock content and structured sections for the article.",
  "frontend/src/pages/BudgetPage.tsx": "Shows budget-based travel categories with icons, destination lists, and tips for planning affordable trips.",
  "frontend/src/pages/BudgetPlanningPage.tsx": "Provides detailed budget planning categories and tips, including card-based breakdowns for different budget tiers.",
  "frontend/src/pages/CommunityPage.tsx": "Presents community-related features like sharing stories and finding travel buddies, with a notice about upcoming functionality.",
  "frontend/src/pages/DestinationDetailPage.tsx": "Displays detailed information about a destination based on slug, including hero image, snapshot info, and fallback handling if not found.",
  "frontend/src/pages/DestinationsPage.tsx": "Searchable, filterable list of destinations with budget tabs and a masonry grid of DestinationCard components.",
  "frontend/src/pages/HomePage.tsx": "Homepage featuring a cinematic hero, highlighted destinations, budget categories, resource links, and map/social components.",
  "frontend/src/pages/ResourcesPage.tsx": "Provides categorized resource cards linking to guides, tips, budgeting, and planning tools for travelers.",
  "frontend/src/pages/SafetyGuidePage.tsx": "Safety guide with emergency numbers and detailed cards covering health, wellness, and essential travel precautions.",
  "frontend/src/pages/TravelTipsPage.tsx": "Travel tips page offering quick tip cards and an accordion with detailed advice for offbeat travel.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and utilities with custom OKLCH variables and plugins.",
  "project_state.json": "Defines project metadata, existing features, and pending requests for building a 50‑destination India travel guide dataset and frontend integration."
}