{
  "backend/main.mo": "Empty Motoko actor with no methods defined.",
  "feature_evidence.json": "Feature evidence report mapping UI updates to DestinationDetailPage.tsx with related components and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files covering global styles, config, pages, components, and hooks.",
  "frontend/index.css": "Base Tailwind setup defining OKLCH theme variables for light and dark modes and applying global background/foreground styles.",
  "frontend/index.html": "HTML entrypoint loading Google Fonts and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Main app router and layout setup with header, footer, mobile nav, theme provider, and routes for all pages.",
  "frontend/src/components/AffiliateCtaPlaceholder.tsx": "Card-based placeholder CTA component with title, description, and a disabled external-link style button.",
  "frontend/src/components/CinematicHero.tsx": "Cinematic hero section with parallax layers, autoplaying video logic, atmospheric overlays, and scroll navigation.",
  "frontend/src/components/DestinationCard.tsx": "Interactive destination card with hover animations, budget/status badges, tags, and link-based navigation.",
  "frontend/src/components/HeroLineSketchOverlay.tsx": "Renders an SVG overlay with animated gradient contour lines that adjust complexity based on mobile detection.",
  "frontend/src/components/InteractiveIndiaMap.tsx": "Displays an interactive India map with clickable regions that show tooltips and scroll to related sections.",
  "frontend/src/components/MasonryGrid.tsx": "Simple wrapper component applying a masonry layout class to its children.",
  "frontend/src/components/MobileBottomNav.tsx": "Provides a fixed mobile bottom navigation bar with icons that highlight based on the current route.",
  "frontend/src/components/MotionReveal.tsx": "Animates children into view using an intersection observer-triggered fade and slide effect.",
  "frontend/src/components/RippleButton.tsx": "Extends a button with a click ripple animation by rendering timed ripple spans.",
  "frontend/src/components/RouteTransition.tsx": "Fades content during route transitions by listening to router load events.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site’s footer with branding, navigation links, resources, and credits.",
  "frontend/src/components/SiteHeader.tsx": "Sticky header with desktop and mobile navigation, scroll-based styling, and theme toggle.",
  "frontend/src/components/SocialProofGallery.tsx": "Scrollable horizontal gallery of user-generated travel photos styled as polaroids.",
  "frontend/src/components/TagChip.tsx": "Displays a styled tag chip with an icon based on the tag type.",
  "frontend/src/components/ThemeToggle.tsx": "Dropdown-based theme switcher allowing light, dark, or system mode selection.",
  "frontend/src/components/TrustBadges.tsx": "Shows a set of trust badges with icons representing verified and curated features.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor using the current Internet Identity and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, stored identities, and auth client setup.",
  "frontend/src/hooks/useIntersectionReveal.ts": "Exposes a ref and visibility flag using IntersectionObserver to reveal elements when they enter the viewport.",
  "frontend/src/hooks/useParallax.ts": "Applies a scroll‑based parallax transform to a referenced element with motion‑reduction and performance checks.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook returning actor state for future backend query integrations.",
  "frontend/src/index.css": "Defines Tailwind base styles and a custom color theme with light/dark palettes and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the app by wrapping it with React Query and Internet Identity providers and rendering the root component.",
  "frontend/src/pages/BlogPage.tsx": "Renders a blog listing page with a featured post, multiple post previews, and animated reveal components.",
  "frontend/src/pages/BlogPostPage.tsx": "Displays a single blog post using mock data, including metadata, HTML content, and navigation back to the blog list.",
  "frontend/src/pages/BudgetPage.tsx": "Renders a budget-based trip planning page with budget ranges, destination lists, and travel tips using cards and animated reveals.",
  "frontend/src/pages/CommunityPage.tsx": "Displays community features like sharing stories, getting advice, finding buddies, and a coming-soon notice.",
  "frontend/src/pages/DestinationDetailPage.tsx": "Shows detailed information for a specific destination including hero image, snapshot stats, description, and travel details.",
  "frontend/src/pages/DestinationsPage.tsx": "Lists all destinations with search, category filtering, and responsive layout using cards and tabs.",
  "frontend/src/pages/HomePage.tsx": "Provides the homepage with a cinematic hero, featured destinations, interactive map, and budget categories.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, typography, animations, container settings, and extended theme values.",
  "project_state.json": "Defines the project’s state, design direction, architectural constraints, and existing features for building a cinematic, youth-focused travel discovery platform with no email-related functionality. Includes UI/UX guidelines, performance requirements, motion rules, and future scalability considerations."
}