{
  "backend/main.mo": "Empty Motoko canister actor with no methods defined.",
  "feature_evidence.json": "Feature evidence report describing a UI change scoped to a specific span element and the file it affects.",
  "frontend-file-summaries.txt": "Collection of short summaries for multiple frontend source files and components.",
  "frontend/index.css": "Tailwind base styles defining extensive OKLCH color variables and dark‑mode overrides.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the root React app.",
  "frontend/src/App.tsx": "Main React app with TanStack Router routes, shared layout, and theme provider.",
  "frontend/src/components/AffiliateCtaPlaceholder.tsx": "Affiliate CTA card component with title, description, and full‑width centered button.",
  "frontend/src/components/CinematicHero.tsx": "Cinematic hero section with parallax background video layers, overlays, and scroll/interaction logic.",
  "frontend/src/components/DestinationCard.tsx": "Interactive destination card with hover animations, image zoom, badges, and a CTA button.",
  "frontend/src/components/HeroLineSketchOverlay.tsx": "SVG overlay rendering animated topographic line sketches with mobile adaptation.",
  "frontend/src/components/InteractiveIndiaMap.tsx": "Renders an interactive India map with clickable region markers that show tooltips and scroll to sections.",
  "frontend/src/components/MasonryGrid.tsx": "Simple wrapper rendering children inside a masonry layout div.",
  "frontend/src/components/MobileBottomNav.tsx": "Provides a mobile bottom navigation bar with route-aware icons and links.",
  "frontend/src/components/MotionReveal.tsx": "Fade‑in and slide‑up animation wrapper using intersection observer visibility.",
  "frontend/src/components/RippleButton.tsx": "Extends a button to show temporary ripple effects at click positions.",
  "frontend/src/components/RouteTransition.tsx": "Wraps content with fade transitions triggered by router navigation events.",
  "frontend/src/components/SiteFooter.tsx": "Displays site footer with branding, links, resources, and a copyright note.",
  "frontend/src/components/SiteHeader.tsx": "Sticky header with desktop and mobile navigation, theme toggle, and scroll-based styling.",
  "frontend/src/components/SocialProofGallery.tsx": "Horizontally scrollable gallery showing user‑generated images with captions.",
  "frontend/src/components/TagChip.tsx": "Styled tag badge component mapping tag types to icons and theme classes.",
  "frontend/src/components/ThemeToggle.tsx": "Dropdown-triggered theme switcher allowing light, dark, or system mode.",
  "frontend/src/components/TrustBadges.tsx": "Shows a row of trust indicator badges with icons and labels.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, and identity loading. Wraps AuthClient setup with configurable options and exposes login status helpers.",
  "frontend/src/hooks/useIntersectionReveal.ts": "A hook that reveals elements when they intersect the viewport using IntersectionObserver. Returns a ref and visibility state with reduced‑motion and trigger‑once handling.",
  "frontend/src/hooks/useParallax.ts": "Implements a parallax scroll effect with performance safeguards, reduced‑motion checks, and mobile intensity adjustments. Returns a ref that applies translateY transforms when visible.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook exposing actor and fetch state for future backend queries. Currently returns values from useActor without additional logic.",
  "frontend/src/index.css": "Defines global Tailwind layers and a custom color system for light and dark modes. Adds typography, layout styles, and utilities for hero gradients and parallax effects.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentityProvider. Mounts App into the root DOM element.",
  "frontend/src/pages/BlogPage.tsx": "Renders a blog listing page with a featured post and multiple post previews using cards, badges, and motion reveal effects. Includes mock post data and links to individual blog posts.",
  "frontend/src/pages/BlogPostPage.tsx": "Displays a single blog post based on the route slug using mock content, including header metadata and rich HTML content. Provides navigation back to the blog list.",
  "frontend/src/pages/BudgetPage.tsx": "Displays budget-based travel ranges with icons, destinations, and tips using animated cards.",
  "frontend/src/pages/CommunityPage.tsx": "Shows community features like sharing stories and finding travel buddies, plus a coming-soon notice.",
  "frontend/src/pages/DestinationDetailPage.tsx": "Renders a detailed view of a destination with hero image, snapshot info, and expandable sections.",
  "frontend/src/pages/DestinationsPage.tsx": "Lists all destinations with search, filters, and category tabs, rendering cards in a grid layout.",
  "frontend/src/pages/HomePage.tsx": "Provides the main landing page with hero section, featured destinations, maps, and budget categories.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, typography, animations, and content scanning paths.",
  "project_state.json": "Defines project vision, design guidelines, performance constraints, and feature requirements for building the Hidden Trails India platform without any email-related functionality. Includes UI/UX direction, scalability notes, animation rules, and existing non‑email feature definitions."
}