{
  "kind": "build_request",
  "title": "Fix region selection so each India region shows its own destinations + add offbeat destinations for all regions (Pulga-style details)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the region-selection behavior so that clicking a region (North/South/East/West/Northeast) does not always show North India destinations; instead, it must show destinations for the clicked region.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Whenever we are clicking on any region, it's only showing the North India destinations."
        ]
      },
      "acceptanceCriteria": [
        "Clicking each region marker (north/south/east/west/northeast) results in a destinations view filtered to that region (not North-only).",
        "North shows only North destinations; South shows only South destinations; East shows only East destinations; West shows only West destinations; Northeast shows only Northeast destinations.",
        "No region click leads to an unfiltered list unless the user explicitly clears the region filter."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement region-aware filtering in the destinations flow using a consistent region identifier shared between the map and the destinations dataset (e.g., 'north' | 'south' | 'east' | 'west' | 'northeast'), so the UI can reliably filter destinations by macro-region instead of only by state name.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Now add offbeat destinations to all the regions in the same format, like pulga"
        ]
      },
      "acceptanceCriteria": [
        "Each destination in the shared data source can be deterministically assigned to exactly one macro-region used by the map (north/south/east/west/northeast).",
        "The destinations listing page can filter by the selected macro-region without relying on brittle string matching against state names.",
        "If an unknown/unsupported region id is encountered, the app falls back to showing all destinations (or a clear empty-state), and does not default to North India."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add offbeat destinations to ALL macro-regions (North, South, East, West, Northeast) in the same Pulga-style detail format (i.e., each destination must include all detail page fields used by DestinationDetailPage: tagline, heroImage, snapshot, detailedDescription, transport, accommodation, localTransport, budgetBreakdown, budgetTotal, faqs).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Now add offbeat destinations to all the regions in the same format, like pulga"
        ]
      },
      "acceptanceCriteria": [
        "The dataset in frontend/src/data/destinations.ts includes multiple destinations across all five macro-regions (north/south/east/west/northeast), not just North.",
        "Every newly added destination renders a complete detail page with the exact same sections/layout as Pulga (no missing fields/sections).",
        "From the destinations list, clicking any newly added destination opens its own unique detail content (not Pulga’s content)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update the interactive region UI to reflect the actual destinations dataset per region (e.g., counts shown in tooltips and any region-specific sections), so displayed counts and region content stay consistent with the underlying data.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Whenever we are clicking on any region, it's only showing the North India destinations."
        ]
      },
      "acceptanceCriteria": [
        "Region destination counts displayed in the map tooltip match the number of destinations in that region in the shared dataset.",
        "Adding/removing destinations in the dataset automatically changes the displayed counts without needing manual edits to hardcoded numbers.",
        "The map remains functional and the selected element (the map image at the provided XPath) continues to render correctly."
      ]
    }
  ],
  "constraints": [
    "Frontend must not modify files under frontend/src/components/ui or any path listed in frontend.immutablePaths (compose existing UI components instead).",
    "Backend must remain single-actor Motoko; do not introduce external databases or services.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Do not add third-party auth providers (only Internet Identity is allowed).",
    "Do not add real-time features (WebSockets/chat).",
    "Do not build a new backend storage system for destinations; keep destinations as the shared frontend data source unless explicitly requested."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}