{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Region-correct destination filtering + offbeat destinations across India (Pulga-style details)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make region selection (North/South/East/West/Northeast) navigate to Destinations with the clicked region applied (not North-only).",
      "acceptanceCriteria": [
        "Clicking each region marker (north/south/east/west/northeast) results in a destinations view filtered to that region (not North-only).",
        "North shows only North destinations; South shows only South destinations; East shows only East destinations; West shows only West destinations; Northeast shows only Northeast destinations.",
        "No region click leads to an unfiltered list unless the user explicitly clears the region filter."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/InteractiveIndiaMap.tsx",
          "operation": "modify",
          "description": "Update region marker click handling to use TanStack Router navigation to the Destinations page with a macro-region search param (e.g., region=north) instead of scrolling to in-page sections; also remove any implicit default-to-north behavior. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update the 'Explore <Region> Destinations' buttons in region sections to deep-link to the Destinations page with the correct macro-region search param so the user lands on a filtered list. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/DestinationsPage.tsx",
          "operation": "modify",
          "description": "Add support for a macro-region search param that filters the listing; include a clear 'region filter' UI state and a way to clear it back to 'all destinations' without resetting to North. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Introduce a shared macro-region identifier across map + dataset and use it for deterministic region filtering with safe fallback behavior.",
      "acceptanceCriteria": [
        "Each destination in the shared data source can be deterministically assigned to exactly one macro-region used by the map (north/south/east/west/northeast).",
        "The destinations listing page can filter by the selected macro-region without relying on brittle string matching against state names.",
        "If an unknown/unsupported region id is encountered, the app falls back to showing all destinations (or a clear empty-state), and does not default to North India."
      ],
      "file_operations": [
        {
          "path": "frontend/src/data/destinations.ts",
          "operation": "modify",
          "description": "Add a typed macro-region identifier (e.g., 'north' | 'south' | 'east' | 'west' | 'northeast') to the Destination model; assign every destination exactly one macro-region; export helper utilities for filtering and counting by macro-region (with safe fallback for unknown region ids). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/DestinationsPage.tsx",
          "operation": "modify",
          "description": "Switch region filtering logic to use the dataset’s macro-region identifier and the router search param, rather than matching against the existing human-readable state/area string; ensure unknown region ids do not default to North. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Expand destinations dataset with offbeat destinations in all five macro-regions, each with complete Pulga-style detail fields used by DestinationDetailPage.",
      "acceptanceCriteria": [
        "The dataset in frontend/src/data/destinations.ts includes multiple destinations across all five macro-regions (north/south/east/west/northeast), not just North.",
        "Every newly added destination renders a complete detail page with the exact same sections/layout as Pulga (no missing fields/sections).",
        "From the destinations list, clicking any newly added destination opens its own unique detail content (not Pulga’s content)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/data/destinations.ts",
          "operation": "modify",
          "description": "Add multiple new offbeat destinations for South/East/West/Northeast (and ensure North remains multi-destination), providing all fields required by DestinationDetailPage (tagline, heroImage, snapshot, detailedDescription, transport, accommodation, localTransport, budgetBreakdown, budgetTotal, faqs) and unique slugs/content per destination; ensure each new destination is assigned the correct macro-region. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Make the interactive region UI (tooltips/counts and region content) reflect live counts from the destinations dataset.",
      "acceptanceCriteria": [
        "Region destination counts displayed in the map tooltip match the number of destinations in that region in the shared dataset.",
        "Adding/removing destinations in the dataset automatically changes the displayed counts without needing manual edits to hardcoded numbers.",
        "The map remains functional and the selected element (the map image at the provided XPath) continues to render correctly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/InteractiveIndiaMap.tsx",
          "operation": "modify",
          "description": "Remove hardcoded region counts and compute tooltip counts from the shared destinations dataset (via new exported helpers); keep the existing India map image rendering intact while ensuring marker tooltips show accurate per-region counts. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update any region-specific copy/sections that imply per-region counts or lists to derive counts from the shared dataset (or avoid hardcoded counts), keeping the UI consistent as destinations are added/removed. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}